app/Http/Controllers/AuthController.php

select * from `users` where `username` = 'burakkaya06' limit 1
---
    public function login(Request $request){

        $field  = $request->validate([
            'username' => 'required|string',
            'password' => 'required|string'
        ]);

        $user = User::where('username',$field['username'])->first();